src/cf/Enums/ВариантыПубликацииДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыПубликацииДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РежимОтладки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСвязанныхОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШаблонСообщения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаРегламентированногоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаименованияДляПечатныхФорм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаименованияДляПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИМНС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПлательщикаПриПеречисленииНалогов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСчетовФактур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЛоготип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФаксимильнаяПечать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКонтактнойИнформации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/уатПодключениеЭПДКонтурДиадок/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипПродукта = "Подсистема";
	
	ПроверитьУстановленностьРешений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаПредупреждение.Видимость = Ложь;
	
	ТекущийЭлемент = Элементы.ДекорацияИнтеграциюБЭДУстановлена;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредупреждениеОписаниеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНаписатьВТехподдержкуНажатие(Элемент)
	
	ОткрытьЦентрПоддержкиНажатие("Чат");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗаказатьЗвонокНажатие(Элемент)
	
	ОткрытьЦентрПоддержкиНажатие("ЗаказатьЗвонок");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЦентрПоддержкиНажатие(СабМодуль)
	
	ПараметрыТехподдержи = Новый Структура("СабМодуль", СабМодуль);
	ДанныеОсновнойОрганизации(ПараметрыТехподдержи);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОсновнойОрганизации(ПараметрыТехподдержи)
	
	ОсновнаяОрганизация = ОрганизацияПоУмолчанию();
	Если ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		СформироватьПараметрыЦентраПоддержки(ОсновнаяОрганизация, ПараметрыТехподдержи);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ВыборОрганизацииЗавершение", ЭтотОбъект, ПараметрыТехподдержи);
		ОткрытьФорму("Справочник.Организации.ФормаВыбора",, ЭтаФорма, Истина,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОрганизацииЗавершение(Организация, ПараметрыТехподдержи) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьПараметрыЦентраПоддержки(Организация, ПараметрыТехподдержи);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПараметрыЦентраПоддержки(ОсновнаяОрганизация, ПараметрыТехподдержи)
	
	Файлы = Новый Массив;
	
	ПараметрыСессии = МодельПараметрыСессии();
	ПараметрыСессии.ДополнительныеПараметры = СобратьТехническуюИнформацию();
	ПараметрыСессии.Файлы = Файлы;
	
	Если ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		ДополнитьДаннымиОрганизации(ОсновнаяОрганизация, ПараметрыСессии);
	КонецЕсли;
	
	ОткрытьЦентрПоддержки(ПараметрыСессии, ПараметрыТехподдержи.СабМодуль);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОрганизацияПоУмолчанию()
	
	Возврат Справочники.Организации.ОрганизацияПоУмолчанию();
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДополнитьДаннымиОрганизации(ОсновнаяОрганизация, ПараметрыСессии)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ОсновнаяОрганизация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	Организации.НаименованиеПолное КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыСессии, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция МодельПараметрыСессии()
	
	Результат = Новый Структура;
	Результат.Вставить("ДополнительныеПараметры", Новый Соответствие);
	Результат.Вставить("ИНН");
	Результат.Вставить("КПП");
	Результат.Вставить("Организация");
	Результат.Вставить("Логин");
	Результат.Вставить("Телефон");    
	Результат.Вставить("ИмяПользователя");
	Результат.Вставить("Файлы", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СобратьТехническуюИнформацию()
	
	СистемнаяИнформация  = Новый СистемнаяИнформация;
	Результат = Новый Соответствие;
	
	Попытка
		
		// Сведения об организациях
		ПредставлениеОрганизаций = "";
		НашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
		Для Каждого Организация Из НашиОрганизации Цикл 
			
			ПредставлениеОрганизации = "ИНН/КПП: %1/%2, Дата границы синхр.: %3";
			ПредставлениеОрганизации = СтрШаблон(ПредставлениеОрганизации, Организация.ИНН, Организация.КПП, Организация.ДатаГраницыСинхронизации);
			ПредставлениеОрганизаций = ПредставлениеОрганизаций + ?(ЗначениеЗаполнено(ПредставлениеОрганизаций), "; ", "") + ПредставлениеОрганизации;
			
		КонецЦикла;
		
		Результат.Вставить("Сведения об организациях", ПредставлениеОрганизаций);
		
	Исключение
		// Ничего
	КонецПопытки;
	
	// Седения о конфигурации
	ПредставлениеКонфигурации = "Имя: %1, Синоним: %2, Номер версии: %3";
	ПредставлениеКонфигурации = СтрШаблон(ПредставлениеКонфигурации, Строка(Метаданные.Имя), Строка(Метаданные.Синоним), Строка(Метаданные.Версия));
	
	Результат.Вставить("Сведения о конфигурации", ПредставлениеКонфигурации);
	
	// Сведения о платформе
	ПредставлениеПлатформы  = "Платформа: %1, Режим совместимости: %2";
	ПредставлениеПлатформы = СтрШаблон(ПредставлениеПлатформы, Строка(СистемнаяИнформация.ВерсияПриложения), Строка(Метаданные.РежимСовместимости));
	
	Результат.Вставить("Сведения о платформе", ПредставлениеПлатформы);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	ОчиститьСообщения();
	
	ОповещениеВопросУстановки = Новый ОписаниеОповещения("УстановитьВопрос", ЭтотОбъект);
	
	Если ТипПродукта = "БЭД" Тогда
		ВариантПоставки = "интеграция БЭД";
	Иначе
		ВариантПоставки = "подсистема Логистика.Контур";
	КонецЕсли;
	ТекстВопроса = "Уверены, что хотите установить вариант поставки: " + ВариантПоставки + "?";
	
	ПоказатьВопрос(ОповещениеВопросУстановки, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсистему(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЭтоПолноправныйПользователь() Тогда  
		ТекстОшибки = "Для установки решения Контур.Логистика обратитесь к администратору.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТипПродукта = "Подсистема";
	
	ОповещениеВопросУстановки = Новый ОписаниеОповещения("УстановитьВопрос", ЭтотОбъект);
	
	ТекстВопроса = "Уверены, что хотите установить вариант поставки: подсистема Логистика.Контур?";
	
	ПоказатьВопрос(ОповещениеВопросУстановки, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтеграциюБЭД(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЭтоПолноправныйПользователь() Тогда
		ТекстОшибки = "Для установки решения Контур.Логистика обратитесь к администратору.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТипПродукта = "БЭД";
	
	ОповещениеВопросУстановки = Новый ОписаниеОповещения("УстановитьВопрос", ЭтотОбъект);
	
	ТекстВопроса = "Уверены, что хотите установить вариант поставки: интеграция БЭД?";
	
	ПоказатьВопрос(ОповещениеВопросУстановки, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьУстановленностьРешений()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Модуль Логистика
	Уставновлена = Метаданные.Подсистемы.Найти("КонтурЛогистика") <> Неопределено;

	Элементы.УстановитьПодсистему.Доступность = Не Уставновлена;
	Элементы.ДекорацияПодсистемаУстановлена.Видимость = Уставновлена;
	
	// Интеграция БЭД
	ОтборРасширения = Новый Структура;
	ОтборРасширения.Вставить("Имя", "КонтурЛогистика");
	
	НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
	Уставновлена = (НайденныеРасширения.Количество() <> 0);
	
	Элементы.УстановитьИнтеграциюБЭД.Доступность = Не Уставновлена;
	Элементы.ДекорацияИнтеграциюБЭДУстановлена.Видимость = Уставновлена;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПолноправныйПользователь()
	
	Возврат Пользователи.ЭтоПолноправныйПользователь();
	
КонецФункции

&НаКлиенте
Процедура УстановитьВопрос(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыУстановки = Новый Структура("Имя, АдресМетода, ЭтоРасширение");
	
	Если ТипПродукта = "БЭД" Тогда
		ПараметрыУстановки.Имя = "КонтурЛогистика";
		ПараметрыУстановки.АдресМетода = "/1c/v2/logist_edo";
		ПараметрыУстановки.ЭтоРасширение = Ложь;
	Иначе
		Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			ПараметрыУстановки.Имя = "РасширениеКонтурЛогистика";
			ПараметрыУстановки.АдресМетода = "/1c/v2/logist_uat_2_2";
			ПараметрыУстановки.ЭтоРасширение = Истина;
		Иначе
			ПараметрыУстановки.Имя = "РасширениеКонтурЛогистика";
			ПараметрыУстановки.АдресМетода = "/1c/v2/logist_uat_prof_2_2";
			ПараметрыУстановки.ЭтоРасширение = Истина; 
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьЖурналРегистраций = Ложь;
	
	ЗагрузитьУстановить(ПараметрыУстановки);
	
	Если ОткрытьЖурналРегистраций Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("СобытиеЖурналаРегистрации", "Бандл");
		Отбор.Вставить("Уровень", "Ошибка");
		
		ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", Отбор, ЭтотОбъект);
	КонецЕсли;
	
	Элементы.ГруппаПредупреждение.Видимость = НуженПерезапуск;
	
	Если НуженПерезапуск Тогда
		ОчиститьСообщения();    
		ТекстОшибки = "Модуль Логистика установлен";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьУстановить(ПараметрыУстановки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверис что дополнительные отчеты и обработки включены
	Если Не ПараметрыУстановки.ЭтоРасширение
		И Не Константы.ИспользоватьДополнительныеОтчетыИОбработки.Получить() Тогда
		
		ТекстОшибки = "Требуется включить в настройках использование дополнительных отчетов и обработок";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ОтборРасширения = Новый Структура;
	ОтборРасширения.Вставить("Имя", ПараметрыУстановки.Имя);
	
	НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
	
	Если НайденныеРасширения.Количество() = 0 Тогда
		ТекущаяВерсияДополнительногоРасширения = "0.0.0";
	Иначе
		ТекущаяВерсияДополнительногоРасширения = НайденныеРасширения[0].Версия;
	КонецЕсли;
	
	СтруктураОбновленияВерсии = ПолучитьСведенияОбОбновлении(ТекущаяВерсияДополнительногоРасширения, ПараметрыУстановки.АдресМетода);
	
	Если СтруктураОбновленияВерсии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СтруктураОбновленияВерсии.Успешно Тогда
		
		Если ЗначениеЗаполнено(СтруктураОбновленияВерсии.Ошибка) Тогда
			СообщениеОбОшибке = Новый СообщениеПользователю();
			СообщениеОбОшибке.Текст = СтруктураОбновленияВерсии.Ошибка;
			СообщениеОбОшибке.Сообщить();
		КонецЕсли;
		
	Иначе
		
		Если Не СтруктураОбновленияВерсии.ЕстьОбновление Тогда
			ТекстОшибки = "Текущая версия модуля актуальна";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураОбновленияВерсии.СсылкаНаЗагрузку) Тогда
			
			// Загружаем с сервиса
			ДвоичныеДанныеОтвет = НачатьЗагрузкуОбновления(СтруктураОбновленияВерсии.СсылкаНаЗагрузку);
			
			Если ДвоичныеДанныеОтвет = Неопределено Тогда 
				ТекстОшибки = "Не удалось получить последнюю версию модуля из сервиса обновлений Контур";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Возврат;
			КонецЕсли;
			
			// Устанавливаем
			Если ПараметрыУстановки.ЭтоРасширение Тогда
				УстановитьРасширение(ДвоичныеДанныеОтвет, ПараметрыУстановки);
			Иначе
				УстановитьОбработку(ДвоичныеДанныеОтвет, ПараметрыУстановки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРасширение(ДвоичныеДанныеОтвет, ПараметрыУстановки)
	
	Попытка
		// Удаляем старую версию
		ОтборРасширения = Новый Структура;
		ОтборРасширения.Вставить("Имя", ПараметрыУстановки.Имя);
		
		НайденныеРасширения = РасширенияКонфигурации.Получить(ОтборРасширения);
		Если НайденныеРасширения.Количество() <> 0 Тогда
			НайденныеРасширения[0].Удалить();
		КонецЕсли;
		
		// Разархивируем полученный пакет
		ЧтениеДанныхАрхив = Новый ЧтениеДанных(ДвоичныеДанныеОтвет);
		ПапкаДляРаспаковки = КаталогВременныхФайлов() + "KonturLogist";
		
		ЧтениеZIP = Новый ЧтениеZIPФайла(ЧтениеДанныхАрхив.ИсходныйПоток());
		ЧтениеZIP.ИзвлечьВсе(ПапкаДляРаспаковки);
		ЧтениеZIP.Закрыть();
		
		// Ищем в файлах расширение
		ФайлыЭД = НайтиФайлы(ПапкаДляРаспаковки, "*.cfe");
		Если ФайлыЭД.Количество() > 0 Тогда
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ФайлыЭД[0].ПолноеИмя);
		Иначе
			ДвоичныеДанныеФайла = Неопределено;
			
			ТекстОшибки = "Ошибка при распаковке ответа сервиса обновлений Контур";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
		// Подчищаем следы
		ФайловаяСистема.УдалитьВременныйКаталог(ПапкаДляРаспаковки);
		
		Если ДвоичныеДанныеФайла = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// Устанавливаем новое расширение
		ДополнительноеРасширение = РасширенияКонфигурации.Создать();
		ДополнительноеРасширение.БезопасныйРежим = Ложь;
		ДополнительноеРасширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		ДополнительноеРасширение.Записать(ДвоичныеДанныеФайла);
		
		НуженПерезапуск = Истина;
	Исключение
		ТекстОшибки = "Не удалось обновить расширение по причине:
			|" + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОбработку(ДвоичныеДанныеОтвет, ПараметрыУстановки)
	
	ИмяФайла = ПараметрыУстановки.Имя + ".epf";
	
	АдресДанныхОбработки = ПоместитьВоВременноеХранилище(ДвоичныеДанныеОтвет, Новый УникальныйИдентификатор);
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Успех", Ложь);
	ПараметрыРегистрации.Вставить("АдресДанныхОбработки", АдресДанныхОбработки);
	ПараметрыРегистрации.Вставить("ОтключатьПубликацию", Ложь);
	ПараметрыРегистрации.Вставить("ОтключатьКонфликтующие", Истина);
	ПараметрыРегистрации.Вставить("Конфликтующие", Новый СписокЗначений);
	ПараметрыРегистрации.Вставить("ЭтоОтчет", Ложь);
	ПараметрыРегистрации.Вставить("ИмяФайла", ИмяФайла);
	
	СправочникОбъект = Справочники.ДополнительныеОтчетыИОбработки.СоздатьЭлемент();
	СправочникОбъект.Заполнить(Неопределено);
	СправочникОбъект.Публикация = Перечисления.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется;
	СправочникОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ДвоичныеДанныеОтвет);
	
	Результат = ДополнительныеОтчетыИОбработки.ЗарегистрироватьОбработку(СправочникОбъект, ПараметрыРегистрации);
	
	Если Результат.Успех Тогда
		
		СправочникОбъект.Записать();
		
		// Установим расширение
		ОбъектВнешнейОбработки = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(СправочникОбъект.Ссылка);
		Результат = ОбъектВнешнейОбработки.Установить();
		НуженПерезапуск = Результат.НуженПерезапуск;
		
		Попытка
			УдалитьОбъект = СправочникОбъект.Ссылка.ПолучитьОбъект();
			УдалитьОбъект.Удалить();
		Исключение
			// Не требуется
		КонецПопытки;
		
	Иначе
		
		Если Результат.ТекстОшибки <> "" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Если Результат.ИмяОбъектаЗанято Тогда
			
			ОбъектВнешнейОбработки = ОбъектВнешнейОбработки(Результат.ИмяОбъекта);
			
			Если ОбъектВнешнейОбработки = Неопределено Тогда
				ТекстОшибки = "Не удалось получить обработку по имени: " + Результат.ИмяОбъекта;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Возврат;
			КонецЕсли;
			
			// Установим расширение
			ОбъектВнешнейОбработки = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ОбъектВнешнейОбработки);
			Результат = ОбъектВнешнейОбработки.Установить();
			НуженПерезапуск = Результат.НуженПерезапуск;
			
			Если Не НуженПерезапуск Тогда 
				ТекстОшибки = "Не удалось установить модуль";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				ОткрытьЖурналРегистраций = Истина;
			КонецЕсли;
			
		Иначе
			ТекстОшибки = "Модуль интеграции БЭД уже был установлен";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьЗагрузкуОбновления(СсылкаНаЗагрузку)
	
	Ответ = СерверОбновлений_ЗагрузитьКонтент(СсылкаНаЗагрузку);
	
	Если Ответ.Успешно Тогда
		
		Возврат Ответ.ТелоОтвета;
		
	Иначе
		
		СообщениеОбОшибке = Новый СообщениеПользователю();
		СообщениеОбОшибке.Текст = "Не удалось получить модуль с сервера обновлений!";
		СообщениеОбОшибке.Сообщить();
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

#Область ОбновлениеСервер

&НаСервереБезКонтекста
Функция ПолучитьСведенияОбОбновлении(НомерВерсии, АдресМетода) Экспорт
	
	СтруктураОбновленияВерсии = ПодготовитьСтруктуруОбновленияВерсии();
	
	Ответ = СерверОбновлений_ПроверитьНовуюВерсию(НомерВерсии, АдресМетода);
	
	Если Ответ.Успешно Тогда
		
		УдалосьРаспарситьОтвет = Ложь;
		
		Попытка
			ДанныеОбновления = JsonПрочитать(Ответ.ТелоОтвета);
			УдалосьРаспарситьОтвет = Истина;
		Исключение
			СтруктураОбновленияВерсии.Ошибка = ОписаниеОшибки();
		КонецПопытки;
		
		Если УдалосьРаспарситьОтвет Тогда
			СтруктураОбновленияВерсии.Успешно = Истина;
			СтруктураОбновленияВерсии.НомерВерсии = ДанныеОбновления.name;
			СтруктураОбновленияВерсии.ЕстьОбновление = ДанныеОбновления.contain_update;
			
			Если СтруктураОбновленияВерсии.ЕстьОбновление Тогда
				
				СтруктураОбновленияВерсии.ДатаВыхода = ДанныеОбновления.release_date;
				
				ОписаниеСтруктура = JsonПрочитать(ДанныеОбновления.description);
				
				Если ТипЗнч(ОписаниеСтруктура) = Тип("Структура") Тогда
					
					СтруктураОбновленияВерсии.СсылкаНаОписание = ОписаниеСтруктура.link;
					СтруктураОбновленияВерсии.КраткоеОписание = СтрЗаменить(ОписаниеСтруктура.description, "\n", Символы.ПС);
					
				КонецЕсли;
				
				Для Каждого СсылкаНаКонтент Из ДанныеОбновления.links Цикл
					
					Если СсылкаНаКонтент.content_type = "zip"
						Или СсылкаНаКонтент.content_type = "extension"
						Или СсылкаНаКонтент.content_type = "data-processor" Тогда
						
						СтруктураОбновленияВерсии.СсылкаНаЗагрузку = СсылкаНаКонтент.href;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		СтруктураОбновленияВерсии.Ошибка = Ответ.Ошибка;
		
	КонецЕсли;
	
	Возврат СтруктураОбновленияВерсии;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодготовитьСтруктуруОбновленияВерсии()
	
	СтруктураОбновленияВерсии = Новый Структура();
	
	СтруктураОбновленияВерсии.Вставить("Успешно", Ложь);
	СтруктураОбновленияВерсии.Вставить("Ошибка", "");
	СтруктураОбновленияВерсии.Вставить("ЕстьОбновление", Ложь);
	СтруктураОбновленияВерсии.Вставить("НомерВерсии", "");
	СтруктураОбновленияВерсии.Вставить("ДатаВыхода", "");
	СтруктураОбновленияВерсии.Вставить("СсылкаНаОписание", "");
	СтруктураОбновленияВерсии.Вставить("КраткоеОписание", "");
	СтруктураОбновленияВерсии.Вставить("СсылкаНаЗагрузку", "");
	
	Возврат СтруктураОбновленияВерсии;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыеПараметрыHTTPЗапроса()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Метод", "GET");
	
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("Параметры", Новый Соответствие);
	
	Результат.Вставить("ТелоЗапроса", Новый Структура("string", "")); // ТелоЗапроса пустая строка
	Результат.Вставить("ТелоОтвета" , Новый Структура("string", "")); // ТелоОтвета вернуть строкой в кодировке сервера
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыСервераОбновлений()
	
	СтруктураПараметровСервераОбновлений = Новый Структура;
	
	ИспользуетсяТестовыйАПИ = Ложь;
	
	Если ИспользуетсяТестовыйАПИ Тогда
		
		СтруктураПараметровСервераОбновлений.Вставить("Адрес", "https://update.testkontur.ru");
		
	Иначе
		
		СтруктураПараметровСервераОбновлений.Вставить("Адрес", "https://update.kontur.ru");
		
	КонецЕсли;
	
	Возврат СтруктураПараметровСервераОбновлений;
	
КонецФункции

&НаСервереБезКонтекста
Функция СерверОбновлений_ПроверитьНовуюВерсию(НомерВерсии, АдресМетода)
	
	АдресМетодаПолное = АдресМетода + "/check/" + НомерВерсии;
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	
	Возврат ВыполнитьHTTPЗапрос_СерверОбновлений(АдресМетодаПолное, ПараметрыЗапроса);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьHTTPЗапрос_СерверОбновлений(АдресМетода, ПараметрыЗапроса, ПередаетсяПолныйАдрес = Ложь)
	
	СтруктураОтвета = Новый Структура("Успешно, Ошибка, ТелоОтвета", Ложь, "", "");
	
	Если Не ПередаетсяПолныйАдрес Тогда
		АдресМетода = ПараметрыСервераОбновлений().Адрес + АдресМетода;
	КонецЕсли;
	
	ЗапросВыполненУспешно = Ложь;
	
	Попытка
		РезультатЗапроса = ВыполнитьHTTPЗапрос(АдресМетода, ПараметрыЗапроса);
		ЗапросВыполненУспешно = Истина;
	Исключение
		СтруктураОтвета.Ошибка = ОписаниеОшибки();
	КонецПопытки;
	
	Если ЗапросВыполненУспешно Тогда	
		Если СокрЛП(РезультатЗапроса.КодСостояния) = "200" Тогда
			СтруктураОтвета.Успешно = Истина;
			СтруктураОтвета.ТелоОтвета = РезультатЗапроса.ТелоОтвета;
		Иначе
			СтруктураОтвета.Ошибка = РезультатЗапроса.ТелоОтвета;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

// Выполняет HTTP запрос к серверу.
//
// Параметры:
//	 Метод 			  - Строка 	  - Метод запроса, например: "GET", "POST".
//	 АдресРесурса 	  - Строка 	  - Адрес ресурса, например: "https://diadoc-api.kontur.ru/GetBox"
//	 ПараметрыЗапроса - Структура - Различные параметры запроса
//	 Состав структуры:
//		Параметры		- Соответствие - (необязательный) Параметры строки запроса, где:
//											Ключ 	 - Имя параметра
//											Значение - Значение параметра
//		Заголовки		- Соответствие - (необязательный) Заголовки запроса, где:
//											Ключ 	 - Имя заголовка
//											Значение - Значение заголовка
//		ТелоЗапроса					   - (необязательный) 
//														 Примеры: Новый Структура("ДвоичныеДанные", ДвоичныеДанные)
//			  													  Новый Структура("file", ПолноеИмяФайла)
//																  Новый Структура("Файл", ПолноеИмяФайла)
//																  Новый Структура("Строка", Строка)
//																  Новый Структура("string", Строка)
//		ТелоОтвета					   - (необязательный)
//														 Примеры: Новый Структура("ДвоичныеДанные", ДвоичныеДанные)
//			  													  Новый Структура("file", ПолноеИмяФайла)
//																  Новый Структура("Файл", ПолноеИмяФайла)
//																  Новый Структура("Строка", Строка)
//																  Новый Структура("string", Строка)
&НаСервереБезКонтекста
Функция ВыполнитьHTTPЗапрос(Адрес, ПараметрыЗапроса) Экспорт
	
	Метод = ПараметрыЗапроса.Метод;
	
	СоставАдреса = Новый Структура;
	СоставАдреса = СтруктураURI(Адрес);
	
	Если ПустаяСтрока(СоставАдреса.Порт) Тогда
		Протокол = ВРег(СоставАдреса.Схема);
		Если Протокол = "HTTP" Тогда
			СоставАдреса.Порт = 80;
		ИначеЕсли Протокол = "HTTPS" Тогда
			СоставАдреса.Порт = 443;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаПараметрыЗапроса = ПолучитьСтрокуПараметровHTTPЗапроса(ПараметрыЗапроса.Параметры);
	АдресРесурса = СоставАдреса.ПутьНаСервере
		+ ?(ПустаяСтрока(СтрокаПараметрыЗапроса), "", "?") + СтрокаПараметрыЗапроса;
	
	Если ВРег(СоставАдреса.Схема) = "HTTPS" Тогда
		ЗащищенноеСоединение = Вычислить("Новый ЗащищенноеСоединениеOpenSSL");
	Иначе
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение(СоставАдреса.Хост, СоставАдреса.Порт, , , , 60, ЗащищенноеСоединение);
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, ПараметрыЗапроса.Заголовки);
	
	Если ПараметрыЗапроса.ТелоЗапроса.Свойство("string")
		Или ПараметрыЗапроса.ТелоЗапроса.Свойство("Строка") Тогда
		
		ТелоЗапроса = ?(
		ПараметрыЗапроса.ТелоЗапроса.Свойство("string"),
		ПараметрыЗапроса.ТелоЗапроса.string,
		ПараметрыЗапроса.ТелоЗапроса.Строка
		);
		
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, "CESU-8");
		
	ИначеЕсли ПараметрыЗапроса.ТелоЗапроса.Свойство("ДвоичныеДанные") Тогда
		
		HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ПараметрыЗапроса.ТелоЗапроса.ДвоичныеДанные);
		
	ИначеЕсли ПараметрыЗапроса.ТелоЗапроса.Свойство("файл")
		Или ПараметрыЗапроса.ТелоЗапроса.Свойство("file") Тогда
		
		ТелоЗапроса = ?(
		ПараметрыЗапроса.ТелоЗапроса.Свойство("файл"),
		ПараметрыЗапроса.ТелоЗапроса.файл,
		ПараметрыЗапроса.ТелоЗапроса.file
		);
		
		HTTPЗапрос.УстановитьИмяФайлаТела(ТелоЗапроса);
		
	КонецЕсли;
	
	Если ВРег(Метод) = "GET" Тогда
		
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		
	ИначеЕсли ВРег(Метод) = "POST" Тогда
		
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	ИначеЕсли ВРег(Метод) = "PUT" Тогда
		
		HTTPОтвет = HTTPСоединение.Записать(HTTPЗапрос);
		
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
	
	Если ПараметрыЗапроса.ТелоОтвета.Свойство("string")
		Или ПараметрыЗапроса.ТелоОтвета.Свойство("Строка") Тогда
		
		Ответ.Вставить("ТелоОтвета", HTTPОтвет.ПолучитьТелоКакСтроку());
		
	ИначеЕсли ПараметрыЗапроса.ТелоОтвета.Свойство("ДвоичныеДанные") Тогда
		
		Ответ.Вставить("ТелоОтвета", HTTPОтвет.ПолучитьТелоКакДвоичныеДанные());
	Иначе
		Ответ.Вставить("ТелоОтвета", "");
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Разбирает строку URI на составные части и возвращает в виде структуры.
// На основе RFC 3986.
//
// Параметры:
//  СтрокаURI - Строка - ссылка на ресурс в формате:
//                       <схема>://<логин>:<пароль>@<хост>:<порт>/<путь>?<параметры>#<якорь>.
//
// Возвращаемое значение:
//  Структура - составные части URI согласно формату:
//   * Схема         - Строка - схема из URI.
//   * Логин         - Строка - логин из URI.
//   * Пароль        - Строка - пароль из URI.
//   * ИмяСервера    - Строка - часть <хост>:<порт> из URI.
//   * Хост          - Строка - хост из URI.
//   * Порт          - Строка - порт из URI.
//   * ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> из URI.
//
&НаСервереБезКонтекста
Функция СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// Строка соединения и путь на сервере.
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// Информация пользователя и имя сервера.
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(ПустаяСтрока(Порт), Неопределено, Число(Порт)));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтрокуПараметровHTTPЗапроса(Соответствие)
	
	Результат = "";
	
	Если ТипЗнч(Соответствие) <> Тип("Соответствие") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Разделитель = "";
	
	Для Каждого Элемент Из Соответствие Цикл
		
		Имя				= Элемент.Ключ;
		Значение		= Элемент.Значение;
		СтрокаЗначение	= Строка(Значение);
		
		Результат = Результат + Разделитель + Имя + ?(ЗначениеЗаполнено(СтрокаЗначение), "=" + СтрокаЗначение, "");
		
		Разделитель = "&";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция JsonПрочитать(Значение)
	
	Попытка
		ЧтениеJSON = Вычислить("Новый ЧтениеJSON");
		ЧтениеJSON.УстановитьСтроку(Значение);
		Результат = Вычислить("ПрочитатьJSON(ЧтениеJSON)");
	Исключение
		Результат = "";
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СерверОбновлений_ЗагрузитьКонтент(АдресКонтента)
	
	ПараметрыЗапроса = НовыеПараметрыHTTPЗапроса();
	ПараметрыЗапроса.Вставить("ТелоОтвета", Новый Структура("ДвоичныеДанные"));
	
	Возврат ВыполнитьHTTPЗапрос_СерверОбновлений(АдресКонтента, ПараметрыЗапроса, Истина);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбъектВнешнейОбработки(ИмяОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Отчеты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК Отчеты
	|ГДЕ
	|	Отчеты.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка)
	|	И Отчеты.ИмяОбъекта = &ИмяОбъекта
	|	И НЕ Отчеты.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ЦентрПоддержки

&НаКлиенте
Функция ОткрытьЦентрПоддержки(ПараметрыСессии = Неопределено, СабМодуль = "Главная") Экспорт
	
	Ресурс = "";
	
	Попытка
		СессияId = СоздатьСессию(); 
	Исключение 
		ТекстОшибки = "Ошибка создания сессии " + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки; 
	
	Если СессияId <> Неопределено Тогда 
		Попытка
			УстановитьСостояние(СессияId, ПараметрыСессии);
		Исключение  
			ТекстОшибки = "Ошибка установки параметров Центра поддержки " + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
		Ресурс = Ресурс + "&mpass_session_id=" + СессияId;
		
		Если СабМодуль = "Главная" Тогда
			Ресурс = Ресурс + "&support_module=main";
		ИначеЕсли НРег(СабМодуль) = "чат" Тогда
			Ресурс = Ресурс + "&support_module=chat";
		ИначеЕсли НРег(СабМодуль) = "заказатьзвонок" Тогда
			Ресурс = Ресурс + "&support_module=callback";
		КонецЕсли;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, "https://support.kontur.ru/?support_widget=logist-1c" + Ресурс);
	
	Возврат СессияId;
	
КонецФункции

&НаКлиенте
Процедура УстановитьСостояние(СессияId, ПараметрыСессии) Экспорт
	
	Если ТипЗнч(ПараметрыСессии) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = _HttpЗапросУстановкаСостояния(СессияId, ПараметрыСессии);
	Ответ = _ОтправитьЗапрос(Запрос);
	
	Если _НегативноеСостояние(Ответ) Тогда
		ВызватьИсключение "Не удалось установить параметры Центра поддержки, код: " + Ответ.КодСостояния + " " 
			+ _ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СоздатьСессию()
	
	Результат = Неопределено;
	Запрос = _HttpЗапросСессия();
	
	Ответ = _ОтправитьЗапрос(Запрос);
	
	Если _НегативноеСостояние(Ответ) Тогда
		ВызватьИсключение "Не удалось создать сессию: " + Ответ.КодСостояния + " "
			+ _ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело);
	КонецЕсли;
	
	Результат = ПолучитьЗначениеПоКлючу(_ПрочитатьJson(_ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело)), "id");
	Возврат Результат
	
КонецФункции

&НаКлиенте
Функция _HttpЗапросСессия()
	 
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("id", Строка(Новый УникальныйИдентификатор));
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json");
	
	Результат = _Запрос();
	Результат.Хост = "api.kontur.ru";
	Результат.Ресурс = "/csi/multipass/v1/sessions";
	Результат.Тело = _ПолучитьДвоичныеДанныеИзСтроки(_ЗаписатьJson(ПараметрыЗапроса));
	Результат.Метод = "POST";
	Результат.Заголовки = Заголовки;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	 
КонецФункции

&НаКлиенте
Функция _HttpЗапросУстановкаСостояния(СессияId, ПараметрыСессии)
	 
	Ресурс = "/csi/multipass/v1/sessions/{sessionId}/states/{stateType}";
	Ресурс = СтрЗаменить(Ресурс, "{sessionId}", СессияId);
	Ресурс = СтрЗаменить(Ресурс, "{stateType}", "external-params");
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-type", "application/json");	
	
	ПараметрыСессии.ДополнительныеПараметры = _ОбъединитьСтруктуры(ПараметрыСессии.ДополнительныеПараметры, 
		_ИнитСистемнаяИнформация());
		
	ТелоСтрокой = _ЗаписатьJson(_СформироватьПараметрыСессииДляЗапроса(ПараметрыСессии));
	
	Результат = _Запрос();
	Результат.Хост = "api.kontur.ru";
	Результат.Ресурс = Ресурс;
	Результат.Тело = _ПолучитьДвоичныеДанныеИзСтроки(ТелоСтрокой);
	Результат.Метод = "PUT";
	Результат.Заголовки = Заголовки;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	 
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _ПолучитьДвоичныеДанныеИзСтроки(Строка, КодировкаТекста_ = "utf-8", ЗаписатьBOM = Ложь)
	
	#Если НЕ ВебКлиент Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		
		Если ЗаписатьBOM Тогда
			ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста_);	
		Иначе	
			ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.ANSI);	
		КонецЕсли;
		ЗаписьТекста.Закрыть();
		
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста_,, Истина, Символы.ПС);
		ЗаписьТекста.Записать(Строка);
		ЗаписьТекста.Закрыть();
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		
		УдалитьФайлы(ИмяВременногоФайла);
		
		Возврат ДвоичныеДанные;
	#КонецЕсли
	Возврат "";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _Запрос()
	
	Результат = Новый Структура;
	Результат.Вставить("Хост");
	Результат.Вставить("Ресурс");
	Результат.Вставить("Тело");
	Результат.Вставить("Метод");
	Результат.Вставить("Заголовки");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция _ЗаписатьJson(Значение)
	
	// BSLLS:Typo-off
	НастройкиСериализации = Вычислить("Новый НастройкиСериализацииJSON");
	НастройкиСериализации.ВариантЗаписиДаты		 = Вычислить("ВариантЗаписиДатыJSON.УниверсальнаяДата");	
	НастройкиСериализации.ФорматСериализацииДаты = Вычислить("ФорматДатыJSON.ISO");
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
		
	ЗаписьJSON = Вычислить("Новый ЗаписьJSON");
	ЗаписьJSON.УстановитьСтроку();
	
	Выполнить("ЗаписатьJSON(ЗаписьJSON, Значение, НастройкиСериализации, ""ФункцияПреобразованияJson"", ЭтаФорма)");	
	// BSLLS:Typo-on
	
	Возврат ЗаписьJSON.Закрыть();	
	
КонецФункции

&НаСервере
Функция _ПрочитатьJson(Значение)
		
	ЧтениеJSON = Вычислить("Новый ЧтениеJSON");
	ЧтениеJSON.УстановитьСтроку(Значение);	
	Результат = Вычислить("ПрочитатьJSON(ЧтениеJSON, Истина)");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция _ОтправитьЗапрос(Запрос)
	
	Результат = _РезультатЗапросаКлиентСервер();
	Соединение = _НовыйЗащищенноеСоединение(Запрос.Хост);	
	HttpЗапрос = _НовыйHTTPЗапрос(Запрос);
	
	Ответ = Соединение.ВызватьHTTPМетод(Запрос.Метод, HttpЗапрос);	
	
	Результат.КодСостояния = Ответ.КодСостояния;
	Результат.Тело = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _РезультатЗапросаКлиентСервер()
	
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния");
	Результат.Вставить("Тело");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция _НовыйЗащищенноеСоединение(Сервер)
	
	ЗащищенноеСоединение = Новый("ЗащищенноеСоединениеOpenSSL");
	Таймаут = 30;
	Соединение = Новый HTTPСоединение(Сервер,,,,, Таймаут, ЗащищенноеСоединение);
	
	Возврат Соединение;
	
КонецФункции

&НаСервере
Функция _НовыйHTTPЗапрос(Запрос)
	
	Результат = Новый HTTPЗапрос(Запрос.Ресурс, Запрос.Заголовки);
	
	Если ТипЗнч(Запрос.Тело) = Тип("ДвоичныеДанные") Тогда
		Результат.УстановитьТелоИзДвоичныхДанных(Запрос.Тело);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные, Кодировка = "utf-8")
	#Если НЕ ВебКлиент Тогда
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	ДвоичныеДанные.Записать(ИмяВременногоФайла);	
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла, Кодировка);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();	
	#КонецЕсли
	Возврат "";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _НегативноеСостояние(HTTPОтвет) Экспорт

	КодПеренаправление = 300;	
	Возврат HTTPОтвет.КодСостояния >= КодПеренаправление;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _ИмяПараметраСервиса(Ключ)
	
	Если Ключ = "ИНН" Тогда
		Результат = "base/inn";
	ИначеЕсли Ключ = "КПП" Тогда
		Результат = "base/kpp";
	ИначеЕсли Ключ = "Организация" Тогда
		Результат = "base/orgname";
	ИначеЕсли Ключ = "Логин" Тогда
		Результат = "base/login";
	ИначеЕсли Ключ = "Телефон" Тогда
		Результат = "base/contactPhone";    
	ИначеЕсли Ключ = "ИмяПользователя" Тогда
		Результат = "base/realname";
	Иначе
		Результат = Ключ; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция _СформироватьПараметрыСессииДляЗапроса(ПараметрыСессии)
	
	// исправлены замечания к сертификации
	ТопикПродукта = "logist-1c";
	
	Результат = Новый Соответствие;
	
	Для Каждого Элемент Из ПараметрыСессии Цикл
		
		Если НЕ ЗначениеЗаполнено(Элемент.Значение) Тогда
			
			Продолжить;
			
		ИначеЕсли Элемент.Ключ = "ДополнительныеПараметры" Тогда
			
			ПараметрыПродукта = _СформироватьДополнительныеПараметры(Элемент.Значение, ТопикПродукта);
			_ОбъединитьСтруктуры(Результат, ПараметрыПродукта);
			
		ИначеЕсли Элемент.Ключ = "Файлы" Тогда
			
			Попытка
				Ссылка = _ЗагрузитьФайлыПолучитьСсылку(Элемент.Значение, ТопикПродукта);
				Результат.Вставить("scope/csi/attachment", Ссылка);
			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецПопытки;
						
		Иначе
			
			Значение = Элемент.Значение;
			Если ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
				
				Значение = СтрЗаменить(Элемент.Значение, Символы.НПП, "");
				
			КонецЕсли;
			
			Результат.Вставить(_ИмяПараметраСервиса(Элемент.Ключ), Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _СформироватьДополнительныеПараметры(ДополнительныеПараметры, Топик)
	
	Результат = Новый Соответствие;
	Для Каждого Элемент Из ДополнительныеПараметры Цикл
		Результат.Вставить("scope/" + Топик + "/" + Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция _ЗагрузитьФайлыПолучитьСсылку(Файлы, Топик)
	
	Если ТипЗнч(Файлы) <> Тип("Массив") Или Файлы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	Запрос = _HttpЗапросЗагрузкаФайлов(Файлы, Топик);	
	Ответ = _ОтправитьЗапрос(Запрос);
	
	Если  _НегативноеСостояние(Ответ) Тогда
		
		ВызватьИсключение "Ошибка, код: " + Ответ.КодСостояния + " " 
			+ _ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело);
		
	КонецЕсли;
	
	ДанныеОтвета = _ПрочитатьJson(_ПолучитьСтрокуИзДвоичныхДанных(Ответ.Тело));
	Результат = ПолучитьЗначениеПоКлючу(ДанныеОтвета, "attachmentLink");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция _HttpЗапросЗагрузкаФайлов(Файлы, Топик_)
	
	Разделитель = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	ПодготовленныеФайлы = _ПодготовитьФайлы(Файлы);
	
	Ресурс = "/csi/attachments/v1/upload?integrationId={integrationId}";
	Ресурс = СтрЗаменить(Ресурс, "{integrationId}", Топик_);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Разделитель);	
		
	Запрос = _Запрос();
	Запрос.Хост = "api.kontur.ru";
	Запрос.Ресурс = Ресурс;
	Запрос.Тело = ЗакодироватьФайлы(ПодготовленныеФайлы, Разделитель);
	Запрос.Метод = "POST";
	Запрос.Заголовки = Заголовки;
	
	Возврат Новый ФиксированнаяСтруктура(Запрос);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗначениеПоКлючу(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство(Ключ) Тогда
		Значение = Структура[Ключ];
	ИначеЕсли ТипЗнч(Структура) = Тип("Соответствие") И Структура.Получить(Ключ) <> Неопределено Тогда
		Значение = Структура.Получить(Ключ);
	Иначе
		Значение = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _ОбъединитьСтруктуры(Структура1 = Неопределено, Структура2 = Неопределено)
	
	// BSLLS:Typo-off
	МутабельныеТипы = Новый Массив;
	МутабельныеТипы.Добавить(Тип("Структура"));
	МутабельныеТипы.Добавить(Тип("Соответствие"));
	
	ИммутабельныеТипы = Новый Массив;
	ИммутабельныеТипы.Добавить(Тип("ФиксированнаяСтруктура"));
	ИммутабельныеТипы.Добавить(Тип("ФиксированноеСоответствие"));
	
	Тип1 = МутабельныеТипы.Найти(ТипЗнч(Структура1)) <> Неопределено;
	Тип2 = МутабельныеТипы.Найти(ТипЗнч(Структура2)) <> Неопределено 
		ИЛИ ИммутабельныеТипы.Найти(ТипЗнч(Структура2)) <> Неопределено;
	// BSLLS:Typo-on
	
	Если Не Тип1 И Не Тип2 Тогда
		Результат = Новый Структура;	
	ИначеЕсли Тип1 И НЕ Тип2 Тогда
		Результат = Структура1; 
	ИначеЕсли НЕ Тип1 И Тип2 Тогда
		Результат = Структура2;
	Иначе
		Для Каждого Элемент Из Структура2 Цикл
			Структура1.Вставить(Элемент.Ключ, Элемент.Значение);	
		КонецЦикла;
		Результат = Структура1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция _ИнитСистемнаяИнформация() 
	
	Результат = Новый Структура;
	СисИнфо = "";
	КонфИнфо = "";
	СистемнаяИнформация = _СистемнаяИнформация();
	
	СвойстваСистемы = Новый Массив;
	СвойстваСистемы.Добавить("client_platform");
	СвойстваСистемы.Добавить("client_type");
	СвойстваСистемы.Добавить("client_version");
	
	СвойстваКонфигурации = Новый Массив;
	СвойстваКонфигурации.Добавить("configuration_version");
	СвойстваКонфигурации.Добавить("configuration_compmode");
	
	Для Каждого Свойство Из СвойстваСистемы Цикл
		Если _СвойствоОпределено(СистемнаяИнформация, Свойство) Тогда
			СисИнфо = СисИнфо + " " + Свойство + ": " + СистемнаяИнформация[Свойство] + ", ";	
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Свойство Из СвойстваКонфигурации Цикл
		Если _СвойствоОпределено(СистемнаяИнформация, Свойство) Тогда
			КонфИнфо = КонфИнфо + " " + Свойство + ": " + СистемнаяИнформация[Свойство] + ", ";	
		КонецЕсли;	
	КонецЦикла;
	
	Результат.Вставить("system_info", СисИнфо);
	Результат.Вставить("conf_info", КонфИнфо);
	Результат.Вставить("configuration_name", СистемнаяИнформация["configuration_name"]);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция _СвойствоОпределено(Структура, Ключ, Приемник = Неопределено, ЗначениеПоУмолчанию = Неопределено)
	
	Перем Значение, Результат;
	
	Результат = Структура.Свойство(Ключ, Значение) И Значение <> Неопределено;
	
	Если Результат Тогда
		Приемник = Значение;
	Иначе
		Приемник = ЗначениеПоУмолчанию;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция _ПодготовитьФайлы(Файлы)
		
	Результат = Новый Массив;
	
	Для Каждого Элемент Из Файлы Цикл
		
		Файл = Новый Структура;
		Файл.Вставить("Имя", "files");
		Файл.Вставить("Данные", Элемент.Данные);
		Файл.Вставить("ИмяФайла", Элемент.ИмяФайла);
		Файл.Вставить("Тип", "multipart/form-data");
		
		Результат.Добавить(Файл);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗакодироватьФайлы(Файлы, Разделитель)
	
	МассивЧастей = Новый Массив;
	РазделительСтрок = Символы.ВК + Символы.ПС;
	
	Для Каждого Файл Из Файлы Цикл
		
		Часть = СоздатьПолеФормы(Файл);
		
		МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки("--" + Разделитель + РазделительСтрок));
		МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки(ЗаголовкиВСтроку(Часть.Заголовки)));
		МассивЧастей.Добавить(Часть.Данные);
		МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки(РазделительСтрок));
		
	КонецЦикла;
	
	МассивЧастей.Добавить(_ПолучитьДвоичныеДанныеИзСтроки("--" + Разделитель + "--" + РазделительСтрок));	

	Возврат _СоединитьДвоичныеДанные(МассивЧастей);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СоздатьПолеФормы(ИсходныеПараметры)
	
	Поле = Новый Структура("Имя,ИмяФайла,Данные,Тип,Заголовки");
	Поле.Имя = ИсходныеПараметры.Имя;
	Поле.Данные = ИсходныеПараметры.Данные;
	
	Поле.Тип = ПолучитьЗначениеПоКлючу(ИсходныеПараметры, "Тип");
	Поле.Заголовки = ПолучитьЗначениеПоКлючу(ИсходныеПараметры, "Заголовки", Новый Соответствие);
	Поле.ИмяФайла = ПолучитьЗначениеПоКлючу(ИсходныеПараметры, "ИмяФайла");
	
	Ключ = "Content-Disposition";
	Если ПолучитьЗначениеЗаголовка("content-disposition", Поле.Заголовки, Ключ) = Ложь Тогда
		Поле.Заголовки.Вставить("Content-Disposition", "form-data");
	КонецЕсли;
	
	Части = Новый Массив;
	Части.Добавить(Поле.Заголовки[Ключ]);
	Части.Добавить(СтрЗаменить("name=""%1""", "%1", Поле.Имя));
	Если ЗначениеЗаполнено(Поле.ИмяФайла) Тогда
		Части.Добавить(СтрЗаменить("filename=""%1""", "%1", Поле.ИмяФайла));
	КонецЕсли;
	
	Поле.Заголовки[Ключ] = СтрСоединить(Части, "; ");
	Поле.Заголовки["Content-Type"] = Поле.Тип;
	
	Возврат Поле;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовкиВСтроку(Заголовки)
	
	РазделительСтрок = Символы.ВК + Символы.ПС;
	Строки = Новый Массив;
	
	СортированныеЗаголовки = "Content-Disposition,Content-Type,Content-Location";
	Для Каждого Ключ Из СтрРазделить(СортированныеЗаголовки, ",") Цикл
		Значение = ПолучитьЗначениеЗаголовка(Ключ, Заголовки);
		Если Значение <> Ложь И ЗначениеЗаполнено(Значение) Тогда
			Строки.Добавить(Ключ + ": " + Значение);
		КонецЕсли;
	КонецЦикла;
	
	Ключи = СтрРазделить(ВРег(СортированныеЗаголовки), ",");
	Для Каждого Заголовок_ Из Заголовки Цикл
		Если Ключи.Найти(ВРег(Заголовок_.Ключ)) = Неопределено Тогда
			Строки.Добавить(Заголовок_.Ключ + ": " + Заголовок_.Значение);
		КонецЕсли;
	КонецЦикла;
	Строки.Добавить(РазделительСтрок);
	
	Возврат СтрСоединить(Строки, РазделительСтрок);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция _СоединитьДвоичныеДанные(МассивДвоичныхДанных) Экспорт
	
	// Аналог СоединитьДвоичныеДанные для 8.2
	#Если НЕ ВебКлиент Тогда
	МассивИменДвоичныхДанных = Новый Массив;
	
	Для Каждого Элемент Из МассивДвоичныхДанных Цикл
			
		// BSLLS:MissingTemporaryFileDeletion-off
		// Диагностика не находит удаления		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();	
		// BSLLS:MissingTemporaryFileDeletion-on	
		МассивИменДвоичныхДанных.Добавить(ИмяВременногоФайла);
		
		Элемент.Записать(ИмяВременногоФайла);		
		
	КонецЦикла;
	
	ИмяВременногоФайлаРезультат = ПолучитьИмяВременногоФайла();
	
	ОбъединитьФайлы(МассивИменДвоичныхДанных, ИмяВременногоФайлаРезультат);	
	
	ДвоичныеДанныеСоединенные = Новый ДвоичныеДанные(ИмяВременногоФайлаРезультат);
	
	// Удаление файлов
	
	УдалитьФайлы(ИмяВременногоФайлаРезультат);	
	Для Каждого ИмяВременногоФайла Из МассивИменДвоичныхДанных Цикл
		УдалитьФайлы(ИмяВременногоФайла);	
	КонецЦикла;
	
	Возврат ДвоичныеДанныеСоединенные;
	#КонецЕсли
	Возврат "";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗначениеЗаголовка(Заголовок_, ВсеЗаголовки, Ключ = Неопределено)
	
	Для Каждого ОчереднойЗаголовок Из ВсеЗаголовки Цикл
		Если НРег(ОчереднойЗаголовок.Ключ) = НРег(Заголовок_) Тогда
			Ключ = ОчереднойЗаголовок.Ключ;
			Возврат ОчереднойЗаголовок.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция _СистемнаяИнформация() 
	
	Возврат _ОбъединитьСтруктуры(_СистемнаяИнформацияНаКлиенте(), _СистемнаяИнформацияНаСервере());
	
КонецФункции

&НаКлиенте
Функция _СистемнаяИнформацияНаКлиенте() 
	
	КонтекстДанные = Новый Структура;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	// Клиент
	
	Информация = Новый Структура;
	Информация.Вставить("client_id"		 , Строка(СистемнаяИнформация.ИдентификаторКлиента)); 
	#Если Не ВебКлиент Тогда
		Информация.Вставить("client_name"	 , ИмяКомпьютера());
	#Иначе
		Информация.Вставить("client_name"	 , "");
	#КонецЕсли
	Информация.Вставить("client_type"	 , _ТипКлиента());
	Информация.Вставить("client_platform", Строка(СистемнаяИнформация.ТипПлатформы));
	Информация.Вставить("client_version" , Строка(СистемнаяИнформация.ВерсияПриложения));
	Информация.Вставить("client_cntmode" , _РежимСоединения());
		
	Возврат Информация; 
	
КонецФункции

&НаКлиенте
Функция _ТипКлиента()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Результат = "ordinary";		
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Тогда
		Результат = "thick";	
	#ИначеЕсли ТонкийКлиент Тогда
		Результат = "thin";
	#ИначеЕсли ВебКлиент Тогда
		Результат = "web";
	#ИначеЕсли МобильныйКлиент ИЛИ МобильноеПриложениеКлиент Тогда
		Результат = "mobClient";	
	#Иначе
		Возврат Неопределено;	
	#КонецЕсли
	
	Если Найти(Строка(СистемнаяИнформация.ТипПлатформы), "64") Тогда
		Результат = Результат + "64";	
	Иначе
		Результат = Результат + "32";	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция _РежимСоединения()
	
	СтрокаСоединения = НРег(СтрокаСоединенияИнформационнойБазы());
	
	Разделитель = Найти(СтрокаСоединения, "=");
	Если Разделитель <> 0 Тогда
		Режим = Лев(СтрокаСоединения, Разделитель - 1);
	Иначе
		Режим = Неопределено;
	КонецЕсли;
	
	Возврат Режим;
	
КонецФункции

&НаСервереБезКонтекста
Функция _СистемнаяИнформацияНаСервере() 

	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Информация = Новый Структура;
	Информация.Вставить("configuration_version" , Строка(Метаданные.Версия));
	Информация.Вставить("configuration_compmode", Строка(Метаданные.РежимСовместимости));
	Информация.Вставить("configuration_name"	, Строка(Метаданные.Имя));
	Информация.Вставить("configuration_version" , Строка(Метаданные.Версия));	
	Информация.Вставить("configuration_changed" , КонфигурацияИзменена());
	
	Информация.Вставить("server_platform", Строка(СистемнаяИнформация.ТипПлатформы));
	Информация.Вставить("server_name"	 , ИмяКомпьютера());
	
	Информация.Вставить("session_locale", _ТекущийКодЛокализации());
	Информация.Вставить("session_tz"	, ЧасовойПоясСеанса());
	Информация.Вставить("session_id"	, _ИдентификаторСеанса());
	
	Возврат Информация; 
	
КонецФункции

&НаСервереБезКонтекста
Функция _ТекущийКодЛокализации() 

	КодЛокализации = ТекущийКодЛокализации();
	Если Найти(КодЛокализации, "_") = 0 Тогда
		КодЛокализации = НРег(КодЛокализации) + "_" + ВРег(КодЛокализации);	
	КонецЕсли;
	
	Возврат КодЛокализации; 
	
КонецФункции

&НаСервереБезКонтекста
Функция _ИдентификаторСеанса() 

	Адрес = НРег(ПоместитьВоВременноеХранилище(Неопределено));	
	Разделитель = НРег("seanceId=");
	Позиция = Найти(Адрес, Разделитель);
	Длина = 36;
	
	Если Разделитель <> 0 Тогда
		Идентификатор = Сред(Адрес, Позиция + СтрДлина(Разделитель), Длина);
	Иначе
		Идентификатор = Неопределено;
	КонецЕсли;
	
	Возврат Идентификатор; 
	
КонецФункции

&НаКлиенте
Процедура ДекорацияТипПродуктаПодсистема1Нажатие(Элемент)
	СтандартнаяОбработка = Ложь;  
	Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, "https://support.kontur.ru/logistika-1s/o-module");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПрочитатьТехническиеТребованияНажатие(Элемент)
	СтандартнаяОбработка = Ложь;  
	Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, "https://support.kontur.ru/logistika-1s/48347-texnicheskie_trebovaniya");
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт
	// Заглушка 
	Заглушка = Истина;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
